{
  "backend/main.mo": "Main actor for the Kartik Cosmetic ICP backend, defining Product, Cart, Order, and UserProfile types with persistent stable maps, and exposing query/update functions for product management, cart operations, order placement, and user profiles with role-based access control.",
  "backend/migration.mo": "Migration module that transforms old actor state (OldProduct with imgUrl, OldLineItem, OldOrder) into the new schema (Product with imageUrl, CartItem, Order with id), mapping all products, carts, and order histories.",
  "feature_evidence.json": "Feature evidence report listing three high-confidence features related to cart/order flow, React Query hooks wiring, and anonymous user browsing, each mapped to specific frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line summaries for every frontend source file, covering styles, hooks, components, and pages of the Kartik Cosmetic React app.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, card, sidebar, and chart colors.",
  "frontend/index.html": "Minimal HTML entry point for the Kartik Cosmetic app, mounting the React app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "TanStack Router configuration defining routes for the product listing, product detail, cart, and order history pages, all wrapped in a shared Layout with a Sonner Toaster.",
  "frontend/src/components/AddProductForm.tsx": "Validated React form component for adding new cosmetic products, with fields for name, category, description, price, quantity, and image URL, using the useAddProduct mutation hook and displaying toast feedback.",
  "frontend/src/components/CartItem.tsx": "Renders a single cart item with product image, name, unit price, quantity selector, subtotal, and a remove button, with loading states for update and remove actions.",
  "frontend/src/components/CategoryTabs.tsx": "Displays a horizontally scrollable row of category filter buttons, prepending an 'All' option, and highlights the currently selected category.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with the brand logo, copyright notice, and a 'Built with caffeine.ai' attribution link.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header with brand logo, desktop nav links (Products, Orders), a cart icon with item count badge, and an Add Product dialog trigger.",
  "frontend/src/components/Layout.tsx": "Simple page layout wrapper that composes Header, a flex-growing main content area, and Footer into a full-height column.",
  "frontend/src/components/OrderCard.tsx": "Displays a single order's details including order number, timestamp, line items with product names, and the total price in a card layout.",
  "frontend/src/components/ProductCard.tsx": "Renders a clickable product card with image, category, name, price, stock badge, and an Add to Cart button that triggers a mutation with toast feedback.",
  "frontend/src/components/QuantitySelector.tsx": "A reusable increment/decrement quantity control with configurable min, max, size, and disabled state.",
  "frontend/src/components/SearchBar.tsx": "A search input with a leading search icon and a clear (X) button that appears when the field has a value.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, and invalidates dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, including login, logout, and identity state management using DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating products, cart items, and orders by calling backend actor methods.",
  "frontend/src/index.css": "Global stylesheet that imports Poppins/Playfair Display fonts, configures Tailwind CSS, and defines a rose-gold/magenta design token palette for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CartPage.tsx": "Cart page component that displays cart items with quantity controls, calculates totals, and handles order placement with success/error feedback.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Order history page that fetches and displays past orders in reverse chronological order, with loading skeletons and an empty state.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page that shows a single product's info, allows quantity selection, and supports add-to-cart and buy-now actions with auth-aware error handling.",
  "frontend/src/pages/ProductListingPage.tsx": "Main homepage component that displays a hero banner, search bar, category filter tabs, and a responsive product grid with loading skeletons and empty states, fetching products via a custom query hook.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL parameters from both query strings and hash-based routing, persist them in sessionStorage, and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a cosmetic-brand theme with custom OKLCH color tokens, brand-specific palette (magenta, rose, gold), typography fonts, border radii, box shadows, and animation keyframes.",
  "project_state.json": "Project state manifest (version 5) describing the Kartik Cosmetic e-commerce app's features, architectural notes, known issues, and existing feature list for build planning purposes."
}